[{"model": "teaminfo.teams", "pk": 1, "fields": {"name": "Victor Mak", "position": "Lead Innovator", "photo": "photos/2025/04/21/WhatsApp_Image_2025-04-16_at_18.54.432.jpeg", "duty": "Victor is the driving force behind ITTC's cutting-edge solutions.", "detail": "Victor's expertise lies in helping organizations effectively evolve to meet today’s seismic cultural, generational, and technological shifts through customer-centered, digitally-enabled innovation. He builds trusted partnerships and high-performing, inspired teams to imagine new futures for everything from supersonic flight to global beauty, enabling organizations to transform their offers, organizations, and industries in line with the rapidly-evolving values, behaviors, and expectations of global consumers. As a lead innovator, Victor is the driving force behind ITTC's cutting-edge robotic solutions. With over 10 years of experience in innovation, he leads the team to success."}}, {"model": "teaminfo.teams", "pk": 2, "fields": {"name": "WC Ng", "position": "Research & Development Engineer", "photo": "photos/2025/04/21/WhatsApp_Image_2025-04-16_at_18.54.43.jpeg", "duty": "WC develops scalable and efficient systems and innovative products for our clients.", "detail": "WC spends his time and experience helping clients and teams grow and bring innovative and transformative products to the world. He oversees the entire development of a project through a process of researching, creating engineering plans for new products,designing new products, redesigning and refining existing products, experimenting, and testing prototypes for functionality and longevity. As a Research & Development Engineer, WC leads our consumer products & retail portfolio, building more beautiful, seamless, and sustainable futures for the things we buy—and the ways that we buy them."}}, {"model": "teaminfo.teams", "pk": 3, "fields": {"name": "Tommy Cheung", "position": "Data Scientist", "photo": "photos/2025/04/21/WhatsApp_Image_2025-04-16_at_18.54.431.jpeg", "duty": "Tommy specializes in AI and data-driven insights and delivers professional technical support.", "detail": "As a data scientist, Tommy has to collect, analyze and interpret large datasets to extrapolate insights. Also, he develops, implements and leverages machine learning models and algorithms. Moreover, he collaborates with WC Chan to ensure data availability and quality. Besides, Tommy communicates data-driven findings and recommendations to stakeholders. In addition to this, he keeps up-to-date with the latest advancements in data science and technology. The role of Tommy is crucial in managing and interpreting data to gather insights that can solve complex problems and guide business strategy and also provide technical support to our valuable clients and partners."}}, {"model": "teaminfo.teams", "pk": 4, "fields": {"name": "Fung Chin San", "position": "Products & Web Designer", "photo": "photos/2025/04/26/Untitled.jpeg", "duty": "Fung Chin San specializes in designing.", "detail": "As a Products & Web designer, Fung Chin San develops and designs websites, applications and other digital products. She works closely with other team members to understand the brand, products and customers – to create products and websites that align with the business identity, vision and needs.\r\n\r\n      Fung Chin San is a highly skilled and experienced Products and Web designer with a passion for creating beautiful and functional IT products and websites. She has a strong understanding of user experience and design principles. Also, she always looks for new ways to improve her skills and stays up-to-date with the latest trends in product and web design."}}]